
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/8129533124)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * google_secret_manager_secret.proxy-sa-secret[&#34;allowed_domains&#34;]
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_secret_manager_secret.proxy-sa-secret["allowed_domains"] will be created
  + resource "google_secret_manager_secret" "proxy-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "allowed_domains"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 1 to add, 1 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":110,"Program":"tfcmt","SHA1":"b31398069dbd5a9c81d2bf373a38e8e68469e5a2","Vars":{},"WorkflowName":"iaac_plan"} -->